Revit 2024 API
BuiltInFailures.SplineFailures Class
 Failures about Spline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class SplineFailures
Visual Basic
Public NotInheritable Class SplineFailures
Visual C++
public ref class SplineFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SplineFailures
See Also
BuiltInFailures.SplineFailures Members
Autodesk.Revit.DB Namespace